src/pdstemplates/QUPA_IN000008UK02.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:hl7="urn:hl7-org:v3">
  <SOAP-ENV:Header>
    <wsa:MessageID>uuid:6A3CDA6A-A8B7-11E1-9663-291BBD30DA30</wsa:MessageID>
    <wsa:Action>urn:nhs:names:services:pdsquery/QUPA_IN000008UK02</wsa:Action>
    <wsa:To>https://pds-sync.nis1.national.ncrs.nhs.uk/syncservice-pds/pds</wsa:To>
    <wsa:From>
      <wsa:Address>10.210.162.81</wsa:Address>
    </wsa:From>
    <hl7:communicationFunctionRcv>
      <hl7:device>
        <hl7:id root="1.2.826.0.1285.0.2.0.107" extension="631955299542"/>
      </hl7:device>
    </hl7:communicationFunctionRcv>
    <hl7:communicationFunctionSnd>
      <hl7:device>
        <hl7:id root="1.2.826.0.1285.0.2.0.107" extension="715373337545"/>
      </hl7:device>
    </hl7:communicationFunctionSnd>
    <wsa:ReplyTo>
      <wsa:Address>10.210.162.81</wsa:Address>
    </wsa:ReplyTo>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body>
    <QUPA_IN000008UK02 xmlns="urn:hl7-org:v3">
      <id root="6A3CDA69-A8B7-11E1-9663-291BBD30DA30"/>
      <creationTime value="20120528122231"/>
      <versionCode code="V3NPfIT3.0"/>
      <interactionId root="2.16.840.1.113883.2.1.3.2.4.12" extension="QUPA_IN000008UK02"/>
      <processingCode code="P"/>
      <processingModeCode code="T"/>
      <acceptAckCode code="NE"/>
      <communicationFunctionRcv typeCode="RCV">
        <device classCode="DEV" determinerCode="INSTANCE">
          <id root="1.2.826.0.1285.0.2.0.107" extension="631955299542"/>
        </device>
      </communicationFunctionRcv>
      <communicationFunctionSnd typeCode="SND">
        <device classCode="DEV" determinerCode="INSTANCE">
          <id root="1.2.826.0.1285.0.2.0.107" extension="715373337545"/>
        </device>
      </communicationFunctionSnd>
      <ControlActEvent classCode="CACT" moodCode="EVN">
        <author1 typeCode="AUT">
          <AgentSystemSDS classCode="AGNT">
            <agentSystemSDS classCode="DEV" determinerCode="INSTANCE">
              <id root="1.2.826.0.1285.0.2.0.107" extension="715373337545"/>
            </agentSystemSDS>
          </AgentSystemSDS>
        </author1>
        <query>
          <historicDataIndicator>
            <semanticsText>HistoricDataIndicator</semanticsText>
            <value code="0" codeSystem="2.16.840.1.113883.2.1.3.2.4.17.36"/>
          </historicDataIndicator>
          <person.id>
            <semanticsText>Person.id</semanticsText>
            <value root="2.16.840.1.113883.2.1.4.1" extension="{{nhsNumber}}"/>
          </person.id>
          <retrievalItem>
            <semanticsText>person.allData</semanticsText>
          </retrievalItem>
        </query>
      </ControlActEvent>
    </QUPA_IN000008UK02>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>